FineMeshWInletrhoSimpleFoam/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField uniform 31904.75;

boundaryField
{
 inletFace
    {
        type           zeroGradient;
    }
    inletWall
    {
        type            epsilonWallFunction;
        value           uniform 31904.75;
    }
    inletsourceFace
    {
        type            zeroGradient;
    }
    inletdestinationFace
    {
        type            zeroGradient;
    }
    fineMeshWall
    {
        type            epsilonWallFunction;
        value           uniform 31904.75;
    }
    fineMeshSourceFace
    {
        type            zeroGradient;
    }
    fineMeshdestinationFace
    {
        type            zeroGradient;
    }
    fineMeshSymmetryWall
    {
        type            symmetryPlane;
    }
    fineMeshOutletLeft
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    fineMeshOutletBottom
    {
        type           zeroGradient;
    }

}


// ************************************************************************* //
