FineMeshWInletrhoSimpleFoam/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
      inletFace
    {
        type            calculated;
        value uniform 0;
    }
    inletWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    inletsourceFace
    {
        type            calculated;
        value uniform 0;
    }
    inletdestinationFace
    {
        type            calculated;
        value uniform 0;
    }
    fineMeshWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    fineMeshSourceFace
    {
        type            calculated;
        value uniform 0;
    }
    fineMeshdestinationFace
    {
        type            calculated;
        value uniform 0;
    }
    fineMeshSymmetryWall
    {
        type            symmetryPlane;
    }
    fineMeshOutletLeft
    {
        type            calculated;
        value uniform 0;
    }
    fineMeshOutletBottom
    {
        type            calculated;
        value uniform 0;
    }

}


// ************************************************************************* //
